{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"trainable": true, "filters": 32, "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_1", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 224, 224, 3], "data_format": "channels_last", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "strides": [3, 3], "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "filters": 64, "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "filters": 64, "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "filters": 128, "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "filters": 128, "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_regularizer": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_regularizer": null, "units": 9, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_7"}, "class_name": "Activation"}], "class_name": "Sequential"}